Revit 2027 API
ImageTypeOptions.SetExternalResourceReference Method
 Update the external resource reference to an image.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetExternalResourceReference(
	ExternalResourceReference resourceReference
)
Public Sub SetExternalResourceReference (
	resourceReference As ExternalResourceReference
)
public:
void SetExternalResourceReference(
	ExternalResourceReference^ resourceReference
)
member SetExternalResourceReference :
        resourceReference : ExternalResourceReference -> unit
Parameters
resourceReference ExternalResourceReference
 An external resource reference to an image.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ImageTypeOptions Class
Autodesk.Revit.DB Namespace